In [1]:
from sqlalchemy import create_engine
import pandas as pd
from warnings import filterwarnings
import pymysql
filterwarnings('ignore', category=pymysql.Warning)
import os

In [2]:
engine = create_engine('mysql+pymysql://root:kcmo1728@localhost/sakila')

##Question 1

In [3]:
actors = pd.read_sql_query("select first_name,last_name from actor", engine)
actors.head()
#Only displaying head to save scrolling

  first_name     last_name
0   PENELOPE       GUINESS
1       NICK      WAHLBERG
2         ED         CHASE
3   JENNIFER         DAVIS
4     JOHNNY  LOLLOBRIGIDA

In [4]:
actor = pd.read_sql_query("select concat(first_name, ' ',last_name) as ActorName from actor", engine)
actor.head()
#Only displaying head to save scrolling

             ActorName
0     PENELOPE GUINESS
1        NICK WAHLBERG
2             ED CHASE
3       JENNIFER DAVIS
4  JOHNNY LOLLOBRIGIDA

##Question 2

In [5]:
sql_query = """
select actor_id, first_name, last_name from actor
where first_name = 'Joe';
"""

new_df = pd.read_sql_query(sql_query, engine)
new_df

   actor_id first_name last_name
0         9        JOE     SWANK

In [6]:
sql_query = """
select actor_id, first_name, last_name from actor
where last_name like '%%gen%%';
"""

new_df = pd.read_sql_query(sql_query, engine)
new_df

   actor_id first_name  last_name
0        14     VIVIEN     BERGEN
1        41      JODIE  DEGENERES
2       107       GINA  DEGENERES
3       166       NICK  DEGENERES

In [7]:
sql_query = """
select actor_id, last_name, first_name from actor
where last_name like '%%li%%'
order by last_name asc, first_name asc;
"""

new_df = pd.read_sql_query(sql_query, engine)
new_df

   actor_id last_name first_name
0        86   CHAPLIN       GREG
1        82     JOLIE      WOODY
2        34   OLIVIER     AUDREY
3        15   OLIVIER       CUBA
4       172  WILLIAMS      HARPO
5       137  WILLIAMS     MORGAN
6        72  WILLIAMS       SEAN
7        83    WILLIS        BEN
8        96    WILLIS       GENE
9       164    WILLIS   HUMPHREY

In [8]:
sql_query = """
select country_id, country from country
where country in ('Afghanistan', 'Bangladesh', 'China');
"""

new_df = pd.read_sql_query(sql_query, engine)
new_df

   country_id      country
0           1  Afghanistan
1          12   Bangladesh
2          23        China

##Question 3

In [9]:
def RunSQL(sql_command):
    connection = pymysql.connect(host='localhost',
                             user='root',
                             password='kcmo1728',
                             db='sakila',
                             charset='utf8mb4',
                             cursorclass=pymysql.cursors.DictCursor)
    try:
        with connection.cursor() as cursor:
            commands = sql_command.split(';')
            for command in commands:
                if command == '\n': continue
                cursor.execute(command + ';')
                connection.commit()
    except Exception as e: 
        print(e)
    finally:
        connection.close()

In [10]:
sql_command = """
alter table actor add middle_name varchar(45) after first_name; 
"""
RunSQL(sql_command)

new_df = pd.read_sql_query('select * from actor',engine)
new_df.head()

(1065, 'Query was empty')

   actor_id first_name middle_name     last_name         last_update
0         1   PENELOPE        None       GUINESS 2006-02-15 04:34:33
1         2       NICK        None      WAHLBERG 2006-02-15 04:34:33
2         3         ED        None         CHASE 2006-02-15 04:34:33
3         4   JENNIFER        None         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY        None  LOLLOBRIGIDA 2006-02-15 04:34:33

In [11]:
sql_command = """
alter table actor modify middle_name blob; 
"""
RunSQL(sql_command)

new_df = pd.read_sql_query('select * from actor',engine)
new_df.head()

(1065, 'Query was empty')

   actor_id first_name middle_name     last_name         last_update
0         1   PENELOPE        None       GUINESS 2006-02-15 04:34:33
1         2       NICK        None      WAHLBERG 2006-02-15 04:34:33
2         3         ED        None         CHASE 2006-02-15 04:34:33
3         4   JENNIFER        None         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY        None  LOLLOBRIGIDA 2006-02-15 04:34:33

In [12]:
#Note:  I verified in MySQL workbench that middle name is blob datatype

In [13]:
sql_command = """
alter table actor drop column middle_name; 
"""
RunSQL(sql_command)

new_df = pd.read_sql_query('select * from actor',engine)
new_df.head()

(1065, 'Query was empty')

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

##Question 4

In [14]:
sql_query = """
select
a.last_name,
count(a.last_name) as count
from actor a
group by a.last_name;
"""

new_df = pd.read_sql_query(sql_query, engine)
new_df.head()
#Only displaying head to save scrolling

  last_name  count
0    AKROYD      3
1     ALLEN      3
2   ASTAIRE      1
3    BACALL      1
4    BAILEY      2

In [15]:
sql_query = """
select
a.last_name,
count(a.last_name) as count
from actor a
group by a.last_name
having count >= 2;

"""

new_df = pd.read_sql_query(sql_query, engine)
new_df.head()
#Only displaying head to save scrolling

  last_name  count
0    AKROYD      3
1     ALLEN      3
2    BAILEY      2
3    BENING      2
4     BERRY      3

In [16]:
sql_query = """
select actor_id, first_name, last_name from actor
where last_name ='williams';
"""

new_df = pd.read_sql_query(sql_query, engine)
new_df

   actor_id first_name last_name
0        72       SEAN  WILLIAMS
1       137     MORGAN  WILLIAMS
2       172      HARPO  WILLIAMS

In [17]:
sql_command = """
update actor
set first_name = 'HARPO'
where first_name = 'GROUCHO' and last_name = 'WILLIAMS';
"""
RunSQL(sql_command)

sql_query = """
select actor_id, first_name, last_name from actor
where last_name ='williams';
"""

new_df = pd.read_sql_query(sql_query, engine)
new_df

   actor_id first_name last_name
0        72       SEAN  WILLIAMS
1       137     MORGAN  WILLIAMS
2       172      HARPO  WILLIAMS

In [18]:
#Question made no sense.  I slacked with Jeff and he agreed.  He shared the solution below, which I understand
#but it's worthless as you'll never hit the else.  I'll leave this hear, but it was not my work.
#Since you manually select actor_id = 172, it's not even a useful piece of code (it's specific to one line)

#UPDATE actor
#SET first_name =
#CASE
#WHEN first_name = 'HARPO'
# THEN 'GROUCHO'
#ELSE 'MUCHO GROUCHO'
#END
#WHERE actor_id = 172;

##Question 5

In [19]:
#I ran  SHOW CREATE TABLE address; in MySQL Workbench

#It returned the following:

#CREATE TABLE `address` (
#  `address_id` smallint(5) unsigned NOT NULL AUTO_INCREMENT,
#  `address` varchar(50) NOT NULL,
#  `address2` varchar(50) DEFAULT NULL,
#  `district` varchar(20) NOT NULL,
#  `city_id` smallint(5) unsigned NOT NULL,
#  `postal_code` varchar(10) DEFAULT NULL,
#  `phone` varchar(20) NOT NULL,
#  `location` geometry NOT NULL,
#  `last_update` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,
#  PRIMARY KEY (`address_id`),
#  KEY `idx_fk_city_id` (`city_id`),
#  SPATIAL KEY `idx_location` (`location`),
#  CONSTRAINT `fk_address_city` FOREIGN KEY (`city_id`) REFERENCES `city` (`city_id`) ON UPDATE CASCADE
#) ENGINE=InnoDB AUTO_INCREMENT=606 DEFAULT CHARSET=utf8'


#I believe I could use the RunSQL function below and insert the create table command
#-- except I'd remove the stuff after the ')' related to ENGINE

#sql_command = """
 
#"""
#RunSQL(sql_command)

#I chose not to run it since the table exists and I didn't want to mess up the database, but I believe
#I did the essence of the question by finding the schema for the table.

##Question 6

In [20]:
sql_query = """
select staff.first_name, staff.last_name, address.address
from staff
inner join address on
staff.address_id = address.address_id;
"""
staff = pd.read_sql_query(sql_query, engine)
staff

  first_name last_name               address
0       Mike   Hillyer     23 Workhaven Lane
1        Jon  Stephens  1411 Lillydale Drive

In [21]:
sql_query = """
select staff.first_name, staff.last_name, sum(payment.amount) as total
from staff
join payment on
staff.staff_id = payment.staff_id
where payment.payment_date >= '2005-08-01'
and payment.payment_date <= '2005-08-31'
group by staff.first_name;
"""
staff = pd.read_sql_query(sql_query, engine)
staff

  first_name last_name     total
0        Jon  Stephens  12218.48
1       Mike   Hillyer  11853.65

In [22]:
sql_query = """
select film.title, count(film_actor.actor_id) as actor_count
from film
inner join film_actor on
film.film_id = film_actor.film_id
group by film.title;
"""
film = pd.read_sql_query(sql_query, engine)
film.head()

              title  actor_count
0  ACADEMY DINOSAUR           10
1    ACE GOLDFINGER            4
2  ADAPTATION HOLES            5
3  AFFAIR PREJUDICE            5
4       AFRICAN EGG            5

In [23]:
sql_query = """
select film.title, count(inventory.inventory_id) as inventory_count
from film
inner join inventory on
film.film_id = inventory.film_id
where film.title = "Hunchback Impossible";
"""
inventory = pd.read_sql_query(sql_query, engine)
inventory

                  title  inventory_count
0  HUNCHBACK IMPOSSIBLE                6

In [24]:
sql_query = """
select customer.first_name, customer.last_name, sum(payment.amount) as Total_Amount_Paid
from customer
join payment on
customer.customer_id = payment.customer_id
group by customer.first_name
order by customer.last_name;
"""
customer = pd.read_sql_query(sql_query, engine)
customer.head()

  first_name  last_name  Total_Amount_Paid
0     RAFAEL      ABNEY              97.79
1  NATHANIEL       ADAM             133.72
2   KATHLEEN      ADAMS              92.73
3      DIANA  ALEXANDER             105.73
4     GORDON     ALLARD             160.68

##Question 7

In [25]:
sql_query = """
select title
from film
where language_id in
 (
    select language_id
    from language 
    where language.name = 'english'
  )
AND
film.title like 'K%%'or film.title like 'Q%%';
"""
films = pd.read_sql_query(sql_query, engine)
films

               title
0      KANE EXORCIST
1        KARATE MOON
2   KENTUCKIAN GIANT
3      KICK SAVANNAH
4   KILL BROTHERHOOD
5    KILLER INNOCENT
6     KING EVOLUTION
7         KISS GLORY
8      KISSING DOLLS
9      KNOCK WARLOCK
10  KRAMER CHOCOLATE
11     KWAI HOMEWARD
12        QUEEN LUKE
13   QUEST MUSSOLINI
14       QUILLS BULL

In [26]:
sql_query = """
select actor.first_name, actor.last_name
from actor
where actor_id in
 (
  select actor_id
  from film_actor
  where film_id in
   (
    select film_id
    from film 
    where film.title = 'Alone Trip'
    )
  );
"""
actors = pd.read_sql_query(sql_query, engine)
actors

  first_name last_name
0         ED     CHASE
1       KARL     BERRY
2        UMA      WOOD
3      WOODY     JOLIE
4    SPENCER      DEPP
5      CHRIS      DEPP
6   LAURENCE   BULLOCK
7      RENEE      BALL

In [27]:
sql_query = """
select customer.first_name, customer.last_name, customer.email, country.country
from customer
inner join address on
customer.address_id = address.address_id
inner join city on
address.city_id = city.city_id
inner join country on
city.country_id = country.country_id
where country.country = "Canada";
"""
canada = pd.read_sql_query(sql_query, engine)
canada

  first_name  last_name                                 email country
0    DERRICK    BOURQUE    DERRICK.BOURQUE@sakilacustomer.org  Canada
1    DARRELL      POWER      DARRELL.POWER@sakilacustomer.org  Canada
2    LORETTA  CARPENTER  LORETTA.CARPENTER@sakilacustomer.org  Canada
3     CURTIS       IRBY        CURTIS.IRBY@sakilacustomer.org  Canada
4       TROY    QUIGLEY       TROY.QUIGLEY@sakilacustomer.org  Canada

In [28]:
sql_query = """
select film.title
from film
where film_id in
 (
  select film_id
  from film_category
  where category_id in
   (
    select category_id
    from category 
    where category.name = 'Family'
    )
  );
"""
family = pd.read_sql_query(sql_query, engine)
family

                     title
0              AFRICAN EGG
1            APACHE DIVINE
2           ATLANTIS CAUSE
3          BAKED CLEOPATRA
4                BANG KWAI
5        BEDAZZLED MARRIED
6          BILKO ANONYMOUS
7          BLANKET BEVERLY
8          BLOOD ARGONAUTS
9           BLUES INSTINCT
10        BRAVEHEART HUMAN
11           CHASING FIGHT
12         CHISUM BEHAVIOR
13          CHOCOLAT HARRY
14        CONFUSED CANDLES
15   CONVERSATION DOWNHILL
16              DATE SPEED
17      DINOSAUR SECRETARY
18              DUMBO LUST
19        EARRING INSTINCT
20        EFFECT GLADIATOR
21            FEUD FROGMEN
22        FINDING ANACONDA
23       GABLES METROPOLIS
24             GANDHI KWAI
25      GLADIATOR WESTWARD
26            GREASE YOUTH
27           HALF OUTFIELD
28             HOCUS FRIDA
29          HOMICIDE PEACH
..                     ...
39          MAGUIRE APACHE
40      MANCHURIAN CURTAIN
41       MOVIE SHAKESPEARE
42          MUSIC BOONDOCK
43           NATURAL STOCK
44            NETWORK PEAK
45             ODDS BOOGIE
46       OPPOSITE NECKLACE
47          PILOT HOOSIERS
48    PITTSBURGH HUNCHBACK
49          PRESIDENT BANG
50         PRIX UNDEFEATED
51              RAGE GAMES
52        RANGE MOONWALKER
53          REMEMBER DIARY
54  RESURRECTION SILVERADO
55          ROBBERY BRIGHT
56         RUSH GOODFELLAS
57        SECRETS PARADISE
58        SENSIBILITY REAR
59             SIEGE MADRE
60              SLUMS DUCK
61             SOUP WISDOM
62       SPARTACUS CHEAPER
63            SPINAL ROCKY
64             SPLASH GUMP
65            SUNSET RACER
66           SUPER WYOMING
67        VIRTUAL SPOILERS
68            WILLOW TRACY

[69 rows x 1 columns]

In [29]:
sql_query = """
select film.title, count(rental.rental_id) as Total_Rentals
from film
join inventory on
film.film_id = inventory.film_id
join rental on
inventory.inventory_id = rental.inventory_id
group by film.title
order by Total_Rentals desc;
"""
rentals = pd.read_sql_query(sql_query, engine)
rentals.head()

                 title  Total_Rentals
0   BUCKET BROTHERHOOD             34
1     ROCKETEER MOTHER             33
2        SCALAWAG DUCK             32
3       FORWARD TEMPLE             32
4  RIDGEMONT SUBMARINE             32

In [30]:
sql_query = """
select staff.store_id, address.address, sum(payment.amount) as Total_Revenue
from payment
join staff on
payment.staff_id = staff.staff_id
join store on
staff.store_id = store.store_id
join address on
store.address_id = address.address_id
group by staff.store_id;
"""
stores = pd.read_sql_query(sql_query, engine)
stores

   store_id             address  Total_Revenue
0         1   47 MySakila Drive       33489.47
1         2  28 MySQL Boulevard       33927.04

In [31]:
sql_query = """
select store.store_id, city.city, country.country
from store
join address on
store.address_id = address.address_id
join city on
address.city_id=city.city_id
join country on
city.country_id = country.country_id;
"""
store = pd.read_sql_query(sql_query, engine)
store

   store_id        city    country
0         1  Lethbridge     Canada
1         2   Woodridge  Australia

In [34]:
sql_query = """
select category.name, sum(payment.amount) as Total_Rentals
from category
join film_category on
category.category_id = film_category.category_id
join inventory on
film_category.film_id = inventory.film_id
join rental on
inventory.inventory_id = rental.inventory_id
join payment on
rental.rental_id = payment.rental_id
group by category.name
order by Total_Rentals desc;
"""
genre = pd.read_sql_query(sql_query, engine)
genre.head()

        name  Total_Rentals
0     Sports        5314.21
1     Sci-Fi        4756.98
2  Animation        4656.30
3      Drama        4587.39
4     Comedy        4383.58

##Question 8

In [35]:
sql_query = """
create view total_rentals_by_genre as
select category.name, sum(payment.amount) as Total_Rentals
from category
join film_category on
category.category_id = film_category.category_id
join inventory on
film_category.film_id = inventory.film_id
join rental on
inventory.inventory_id = rental.inventory_id
join payment on
rental.rental_id = payment.rental_id
group by category.name
order by Total_Rentals desc;
"""
RunSQL(sql_query)

In [36]:
#I verified that total_rentals_by_genre is in my views by looking at MySQL workbench

In [37]:
total_rentals = pd.read_sql_query('select * from total_rentals_by_genre', engine)
total_rentals.head()

        name  Total_Rentals
0     Sports        5314.21
1     Sci-Fi        4756.98
2  Animation        4656.30
3      Drama        4587.39
4     Comedy        4383.58

In [38]:
RunSQL('drop view total_rentals_by_genre')

In [39]:
#I verified that total_rentals_by_genre is no longer in my views by looking at MySQL workbench